<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [359]:
import pandas as pd
import psycopg2

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [362]:
# Считаем общее количество вакансий. Тут все просто.
query = f'''SELECT 
                COUNT(id) 
            FROM public.vacancies
'''

In [363]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [364]:
# Посчитаем количество работадателей по id из таблицы employers
query = f'''SELECT 
                COUNT(id) 
            FROM public.employers
'''

In [365]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [366]:
# по тому же методу посчитаем количество регионов
query = f'''SELECT 
                COUNT(id) 
            FROM public.areas
'''

In [367]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [368]:
# текст запроса
query = f'''SELECT 
                COUNT(id) 
            FROM public.industries 
                    
'''
#Группируем по названиям регионов и количеству вакансий, считаем через COUNT, в этих регионах через. Предварительно соединив
# Таблицы регионов и вакансий. Сортируем по колчиству по убывани ORDER BY и выводим 5 строк  через LIMIT

In [369]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    294

***

In [370]:
# У нас достаточно большая география, много регионов. И достаточно большая база вакансий на такое количество работадателей, так как нужны разные специалыисты для разных сфер деятельности.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [371]:
query = f'''SELECT 
                a.name,
                COUNT(v.id) 
            FROM public.areas a
                JOIN vacancies v ON v.area_id = a.id
            GROUP BY a.name
            ORDER BY 2 desc
            LIMIT 5
'''
#Группируем по названиям регионов и количеству вакансий, считаем через COUNT, в этих регионах через. Предварительно соединив
# Таблицы регионов и вакансий. Сортируем по колчиству по убывани ORDER BY и выводим 5 строк  через LIMIT

In [372]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

              name  count
0           Москва   5333
1  Санкт-Петербург   2851
2            Минск   2112
3      Новосибирск   2006
4           Алматы   1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [373]:
# Как я понял задание, нужно посчитать колчество вакансий в которых есть значения хотя бы  в одной из краев вилки по зарплате
query = f'''SELECT 
                COUNT(v.id) 
            FROM public.vacancies v
            WHERE salary_from IS NOT NULL OR salary_to IS NOT NULL
                    
'''
#Мы просто считаем вакансии? поставив условие WHERE, где столбики наших вилок не равны NULL

In [374]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [375]:
# Среднее по границам вилки, тоже посчитать не сложно
query = f'''SELECT 
                ROUND(AVG(v.salary_from)),
                ROUND(AVG(v.salary_to))

            FROM public.vacancies v
               
                    
'''
# Мы просто берем и считаем по каждому из наших столбцов нашей вилки среднее, с помощью оператора AVG, и округляем для удобства ROUND.

In [376]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [377]:
# Запрос тоже для простой и понятный. Группруем через GROUP BY по типам рабочего графика и типам трудоустройства и сортируем ORDER BY по убыванию
query = f'''SELECT 
                v.schedule,
                v.employment,
                COUNT(v.id)
            FROM public.vacancies v
            GROUP BY v.schedule, v.employment
            ORDER BY COUNT(v.id) DESC

            
                               
'''

In [378]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [379]:
# Сгруппировали GROUP BY по показателям опыта, посчитав количество каждого показателя через COUNT и отсортировали по возростанию ORDER BY по количеству
query = f'''SELECT 
                v.experience,
                COUNT(v.id)
            FROM public.vacancies v
            GROUP BY v.experience
            ORDER BY COUNT(v.id)                       
'''

In [380]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [381]:
# Вывовды такие, что количество молодых специалистов почти без опыта и с опытом от года до 3 лет.Это 26152 + 7197 = 33349,  Сильно выше чем специалистов с опытом более 6 лет 1337.
# Похоже люди склонны менять нишу или специальность, через пару лет как поработует сферу, возможно выгорают, или становяться настолько богатыми, что бросают все дела и летят на Бали.
# А получается кто работает больше 6 лет, они либо очень любят то что они делают, или очень жадные)))
# Большинство специалистов ищут основную работу 35367, на полную занятость и на полный рабочий день, в основном все люди хотят заниматься чем то одним целый день и максимально выкладываться именно там, где они работают и это очень 
# хорошо. Ну это же логично и просто целый день отработал и отдыхаешь и если тебе вдруг предлагают заниматься чем то другим, у человека есть грамотный отмазон, ну я же занят, я весь в работе))) 
# А тех кто хочет заниматься не только работой, но и чем для себя намного меньше, там где гибкий график или частичная занятость.
# Средние показатели зп, ну это вообще показатели которые просто камнем по сердцу, вот наша любимая статистика по ЗП, абсолютно не объективная. В основном всем людям хватает зп в районе 70-120 тыс. без коментариев. Те люди у которых ипотека, машина, дети, а еще отпуск более менее хоть на недельку, меня поймут.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [382]:
# Соединили две таблицы, что бы посчитать количество Вакансий от каждого работодателя, сгруппировав их через GROUP BY, отсортировали по убыванию количества и оставили только 5 строк.
query = f'''SELECT 
                e.name,
                COUNT(v.id)
            FROM public.vacancies v
                JOIN public.employers e ON e.id = v.employer_id
            GROUP BY e.name
            ORDER BY COUNT(v.id) DESC
            LIMIT 5                       
'''

In [383]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [384]:
# Здесь мы группируем по регионам и количеству вакансий и работодателей в них. Для того, что бы выяснить наибольшее количество регионов
# в которых нет вакансий, нам потребовалось соединить по методу LEFT JOIN, что бы у нас взялись все регионы с основной таблицы, а в соединяемой таблице
# не вошли те строки, в которых нет значений совподоющих с правой частью. и добовали условие отобразить регионы, где v.area_id IS NULL
# И отсортировали по колчиству работодателей по убыванию и отобразили первую строку через LIMIT
query = f'''SELECT 
                a.name,
                COUNT(DISTINCT v.id),
                COUNT(DISTINCT e.id)
            FROM public.areas a
                LEFT JOIN public.vacancies v ON a.id = v.area_id
                LEFT JOIN public.employers e ON e.area =a.id
            WHERE v.area_id IS NULL
            
            GROUP BY a.name
            ORDER BY 3 DESC
            LIMIT 1                       
'''

In [385]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     name  count  count
0  Россия      0    410

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [386]:
query = f'''SELECT 
                e.name,
                COUNT(DISTINCT v.area_id)
            FROM public.employers e
                JOIN public.vacancies v ON v.employer_id = e.id
            
            GROUP BY e.name
            ORDER BY 2 DESC
                                 
'''
# Группируем  по  работодателям и количеству уникальных DISTINCT ареа id, в таблице вакансий. Предварительно соединив таблицы работодателей и вакансий
# И сортирукм по количеству по убыванию ORDER BY 2 DESC

In [387]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [388]:
# Для решения этого вопроса мы соединили соединили по методу LEFT таблицу с работодателями и таблицу с их сферами деятиельности.
# в таблице мы посчитали количество работодателей COUNT(e.id), у которых WHERE i.industry_id IS NULL
query = f'''SELECT 
                COUNT(e.id) 
            FROM public.employers e
            LEFT JOIN public.employers_industries i on e.id = i.employer_id
            WHERE i.industry_id IS NULL
                                 
'''

In [389]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [390]:
# текст запроса
query = f'''SELECT 
                e.name,
                COUNT(ie.industry_id)
            FROM public.employers_industries ie
            JOIN public.industries i ON i.id = ie.industry_id
            JOIN public.employers e ON e.id = ie.employer_id
            GROUP BY e.name
            HAVING COUNT(ie.industry_id) = 4
            ORDER BY e.name 
            LIMIT 1
            OFFSET 2
            
                                 
'''
# В этом запросе пришлось соединить 3 таблицы, выбрали показать имя компаний и посчитать количество индустрий для каждой компании
# соответственно получилась такая группировка, далее через ORRDER BY отсортировали по алфавиту, выбрали те компании у которых по 4 сферы деятельности,
# через лимит попросили показать одну строку и через OFFSET убрали верхние 2 строки

In [391]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [392]:
# текст запроса
query = f'''SELECT 

                COUNT(e.id)
            FROM public.employers_industries ie
            JOIN public.industries i ON i.id = ie.industry_id
            JOIN public.employers e ON e.id = ie.employer_id
            WHERE i.name = 'Разработка программного обеспечения'
                      
'''
# В наши уже соединненные таблицы добовали фильтр где, название сферы деятельноти указан на необходимый и посчитали колличество работодателей через COUNT(e.id)

In [393]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [394]:
import requests # Импортируем библиотеку requests
from bs4 import BeautifulSoup 
# from pprint import pprint 
# import codecs
# сначала открываем страницу Wikipedia, проверяем статус
url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России' # Определяем значение URL страницы для запроса
response = requests.get(url) # Делаем GET-запрос к ресурсу и результат ответа сохраняем в переменной response
print(response.status_code, 'Значит, всё открылось нормально\n')
#print(response.text)
# дальше работа с содержимым страницы
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup, указывая html-парсер
print(page.title.text,'\n')                        # Выводим текст из полученного тега, который содержится в атрибуте text
tabl = page.find("table", class_="standard")       # ищем на странице таблицу

town = []
tt = tabl.find("tbody") # в таблице выбираем тело таблицы
qq = tt.find_all("tr")  # в теле таблицы выбираем все ряды

for ss in qq:
  qqq = list(ss.find("a"))  # в каждом ряде находим тег "а", преобразуем его в список
  town.append(qqq[0])       # и добавляем содержимое к списку городов
town = town[1:]             # в первом ряду кусок от названия, отсекаем его
town = tuple(town)

print(town)

200 Значит, всё открылось нормально

Города-миллионеры России — Википедия

('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Красноярск', 'Нижний Новгород', 'Челябинск', 'Уфа', 'Самара', 'Ростов-на-Дону', 'Краснодар', 'Омск', 'Воронеж', 'Пермь', 'Волгоград')

In [395]:
# текст запроса
query = f'''WITH temp AS(
                SELECT a.name,
                     COUNT (*) cnt
                FROM 
                     vacancies v
                LEFT JOIN 
                     areas a ON a.id = v.area_id
                LEFT JOIN 
                     employers e ON e.id = v.employer_id
                WHERE e.name = 'Яндекс'
                      AND a.name in {town}
                GROUP BY 1
                ORDER BY 2
               )
                SELECT *  FROM temp
                UNION ALL
                SELECT 
                     'Total', 
                     sum(cnt)  
                FROM temp'''
# В запросе используем конструкцию WITH результат записываем в temp, в котором мы посчитали количество вакансий по условияям, что бы 
# название работодателя была ЯНДЕКС и название региона было в списке милионников
# склеиваем два запроса готовый запрос из temp  новый запрос в котором мы суммировали количество вакансий из предидущего запроса и тобавили запись total

In [396]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

               name    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7               Уфа   26.0
8            Самара   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            Total  485.0

***

In [397]:
# выводы по анализу работодателей
# По количеству вакансий явный чемпион компания яндекс, по теории это скорее всего потому что яндекс имеент очень большое количесво
# сфер деятельности, остальные же сильно ниже. Так же компания Яндекс чемпион по занимаемой географии и с ней рядом находиться Ростелеком, который не так давно приобрел Wink и возможно в связи с эти набирают команды
# в регионах. Интересно, что такая вакансия как "Разработка программного обеспечения" так широко распространяется и айти становиться необоходимым
# для ведения разного рода бизнеса.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [398]:
# текст запроса
query = f'''SELECT 

                COUNT(id)
            FROM public.vacancies 
            WHERE (name LIKE '%data%') OR (name LIKE'%данн%') OR (name LIKE '%DATA%') OR (name LIKE'%ДАНН%') OR (name LIKE '%Data%') OR (name LIKE'%Данн%')
                      
'''
# Посчитали колличетсво вакансий, при необходимых условиях,учитывая регистр

In [399]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [400]:
# текст запроса
query = f'''SELECT
                COUNT(v.name)

            FROM vacancies v

            WHERE
(
    (name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)

    AND (v.name ILIKE '%junior%'
    OR v.experience ILIKE '%Нет опыта%'
    OR v.employment ILIKE '%Стажировка%')
'''
# В этом запросе мы посчитали количество вакансий, учивая все необходимые условия, по условию задачи.

In [401]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [402]:
# текст запроса
query = f'''SELECT 
     COUNT(v.id)

FROM vacancies v

WHERE ( (v.key_skills like '%SQL%')
        or
        (v.key_skills ilike '%postgres%')
        )
    AND
(
    (name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)
    
'''
# В данном задании мы посчитали количество вакансий в которых (WHERE) у нас есть SQL and postgres и остальные условия, которые говорят
# о том, что они входят в DS

In [403]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [404]:
# текст запроса
query = f'''SELECT 
     COUNT(v.id)

FROM vacancies v

WHERE (v.key_skills LIKE  '%Python%' 
    OR v.key_skills LIKE  '%python%' 
    OR v.key_skills LIKE  '%PYTHON%')
        
    AND
(
    (name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL) 
)   
'''
# В данном задании мы посчитали количество вакансий в которых (WHERE) у нас есть, где ключвые скилы  уже Python и остальные условия, которые говорят
# о том, что они входят в DS

In [405]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [406]:
# текст запроса
query = f'''SELECT
ROUND(AVG(length(key_skills) - length(replace(key_skills,CHR(9),''))+1),2)

FROM vacancies v

WHERE
(
       (v.name ILIKE '%data scientist%')
    OR (lower(v.name) ILIKE '%data science%')
    OR (v.name ILIKE '%исследователь данных%')
    OR (v.name  LIKE '%ML%' AND  (v.name NOT iLIKE '%html%'))
    OR (v.name ILIKE '%machine learning%')
    OR (v.name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)
'''
# В запросе мы заменяем с начала символы табулияции на пустые строки, то есть удаляем их и получаем строку без табуляции, 
# затем длину строки с табуляцией (length(key_skills) мы вычетаем нашу получившуюся строку без табулияций, получается что у нас получиться 
# количество символов "/" и правляем к этому единичку и полуается количество навыков. После этого мы берем из этого среднее 
# и округляем до двух знаков.

In [407]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [408]:
# текст запроса
query = f'''SELECT
            v.experience, 
            ROUND(AVG(coalesce((v.salary_from + v.salary_to) / 2, v.salary_from, v.salary_to)), 0)

FROM vacancies v

WHERE
(
       (v.name ILIKE '%data scientist%')
    OR (lower(v.name) ILIKE '%data science%')
    OR (v.name ILIKE '%исследователь данных%')
    OR (v.name  LIKE '%ML%' AND  (v.name NOT iLIKE '%html%'))
    OR (v.name ILIKE '%machine learning%')
    OR (v.name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)

GROUP BY v.experience
ORDER BY 1
'''
# Что мы здесь делаем? мы суммируем границы по зарплате и делим на 2, что бы избежать получения null при суммировании, мы используем
# coalesce, и если одна из границ будет null, мы просто заменим ее на одну из границ. Затем берем среднее AVG и округляем до целого значения.

In [409]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience     round
0         Более 6 лет       NaN
1           Нет опыта   74643.0
2  От 1 года до 3 лет  145236.0
3       От 3 до 6 лет  243115.0

In [ ]:
# Дополнительные иследования
query = f'''SELECT
                a.name,
                v.schedule,
                COUNT(v.schedule)
            
            FROM vacancies v
            JOIN areas a ON v.area_id = a.id
            WHERE v.schedule = 'Удаленная работа'
            
            GROUP BY v.schedule, a.name
            
            ORDER BY 3 desc
            LIMIT 15
'''
# В этом запросе я сгруппировал по виду занятости, городам и посчитал количество видов занятостией, в которых указана именно удаленная работа
# предварительно, соеденив таблцы. Далее мы отсортировали по количеству и вывели 15 строк.

In [416]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            schedule             name  count
0   Удаленная работа           Москва    998
1   Удаленная работа  Санкт-Петербург    462
2   Удаленная работа  Нижний Новгород    405
3   Удаленная работа      Новосибирск    345
4   Удаленная работа            Минск    339
5   Удаленная работа        Краснодар    333
6   Удаленная работа           Казань    289
7   Удаленная работа     Екатеринбург    278
8   Удаленная работа   Ростов-на-Дону    272
9   Удаленная работа           Самара    254
10  Удаленная работа           Алматы    235
11  Удаленная работа          Воронеж    207
12  Удаленная работа       Нур-Султан    195
13  Удаленная работа            Пермь    192
14  Удаленная работа        Челябинск    152

In [ ]:
#  В данном запросе я хотел продемонстрировать количество вакансий по удаленке в разных городах. Все достаточно пропорционально логично и закономерно. Чем больше население города, тем больше вакансий по удаленке в них есть.

***

In [425]:
query = f'''SELECT
                experience,
                ROUND(avg(length(key_skills) - length(replace(key_skills,CHR(9),''))+1),2)
            
            FROM vacancies
            GROUP BY experience
            ORDER BY 2 desc
            
'''
# В этом запросе мы взяли опыт и посчитали так же среднее количество навыков на этот опыт, сгруппировали его и отсортировали по среднему количеству навыков

In [426]:
df = pd.read_sql_query(query, connection)
df

C:\Users\user\AppData\Local\Temp\ipykernel_11208\137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience  round
0         Более 6 лет   6.95
1       От 3 до 6 лет   6.41
2  От 1 года до 3 лет   6.38
3           Нет опыта   6.06

In [ ]:
# В этом запросе хотелось отобразить что среднее количество навыков так же связано  с опытом работ. И в среднем чем более опытный сотрудник,тем больше ключевых навыков

In [413]:
# выводы по предметному анализу
# Если мы берем колличество Вакансий именно для начинающих датасаентистов 51 шт ко всем вакасиям по данным 1771. Это очень не большая доля, можно сделать вывод, что все таки 
# большинству работодателей требуются специлисты с опытом, они готовы платить больше, что видно по уровню зарплат в зависимости от опыта
# главное, что бы специалист был максимально самостоятельный и опытный, что бы максимально качественно делать работу компании и 
# выполнять заказы клиентов, все логично.
# Да и количество навыков специалистов датасайнс достаточно внушительное, ну зарплата достойная правда только у опытных специалистов

# Общий вывод по проекту

In [414]:
# подведем итог исследования, обобщите выводы
# Напрашивается вывод, что география работодателей, как и самих работодатей достаточно обширное и покрывает большинство крупных городов, 
# очень сильно на фоне остальных выделяются такие гиганты как ЯНДЕКС, СБЕР, РОСТЕЛЕКОМ и по данным так же можно сделать вывод, что необходимость специалистов в сфере айти имеет тенденцию к росту
# Все больше и больше компаний пользуются услугами компаний предоставляющих услуги аналитики данных, датасайнс и для увеличения рентабельности своего бизнеса, прогнозирования роста, точек роста бизнеса.
# А так же больше компаний вводят штат таких специалистов для увеличения прибыли. 
# Соответсветнно рынок айти специалистов будет расширяться и будут требоваться именно опытные специалисты и 
# желательно, что бы у специалистов была мотивация для роста и удержании себя на своей специальности, т.к. есть тенденция, что многие специалисты меняют профессии, мы это видели, когда расматривали специалистов с опытом работы более 6 лет, а их 
# сильно меньше чем специалистов с опытом 3-6 лет.